
/*
1. Напишите программу, которая будет запрашивать у пользователя число и
выводить его факториал.

*/


/*
let fac =prompt('введи число ');
let i = 1;
let return1 = 1;
while( i<=fac){
    return1*=i;
    i++;
}
alert(return1);
*/




/*
2.Напишите программу, которая запрашивает у пользователя число и выводит
таблицу умножения для этого числа от 1 до 10.

*/


/*
let nun = prompt('введи число ');
let i = 1;


let return2 = 1;

while(i<=10){
    console.log(return2=n*nun);
    i++;
}
    */


/*
3.Напишите программу, которая будет запрашивать у пользователя числа, пока он
не введет ноль. После ввода нуля программа должна вывести сумму всех
введенных чисел.
*/


/*

let nun2=0;
let count=0 ;
let return3=0;
do{
    nun2 = Number(prompt('введи число '));
    return3+=nun2;
    count++;
}while(nun2!=0){
    alert(`ты ввёл верно число попыток ${count}  сумма =  ${return3}`);
}
*/

/*
4.Напишите программу, которая будет запрашивать у пользователя ввод пароля
до тех пор, пока он не введет правильный пароль (например, "12345").

*/
/*
let parola ;

do{
    
    parola=prompt('введи пароль ')
   
}while(parola!='marvelhalc'){
    alert('вход выполнен')
}*/


/*
5.Напишите программу, которая будет запрашивать у пользователя число и
проверять, является ли оно простым. Программа должна продолжать
запрашивать числа, пока пользователь не введет отрицательное число.

*/


/*
let nun3 =0;
let = 0;
do{
nun3=Number(prompt('введи число '))
}while(nun3%2!=0){
alert('отрицательное число ')
}
*/